# SetRoofStyle

## Description
Sets the Roof Style of a roof.

```pascal
PROCEDURE SetRoofStyle(
				roof      : HANDLE;
				roofStyle : LONGINT);
```

```python
def vs.SetRoofStyle(roof, roofStyle):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|roof|HANDLE|The roof.|
|roofStyle|LONGINT|The Roof Style.|

## See Also
VS Functions:
GetRoofStyle

## Version
Availability: from Vectorworks 2016

## Category
* Objects - Roofs